app/controllers/identities_controller.rb

  def index
    @identities = Identity.all
---
SELECT "identities".* FROM "identities"

  def create
    @identity = Identity.new(identity_params)
    @identity.user_id = current_user.id
    @identity.user_name = current_user.name

    @identity.save
---
INSERT INTO "identities" ("campus", "created_at", "name", "updated_at", "user_id", "user_name") VALUES (?, ?, ?, ?, ?, ?)  [["campus", ""], ["created_at", Mon, 02 Mar 2015 00:17:46 UTC +00:00], ["name", "r"], ["updated_at", Mon, 02 Mar 2015 00:17:46 UTC +00:00], ["user_id", 1], ["user_name", "Rodrigo"]]

    def set_identity
      @identity = Identity.find(params[:id])
---
SELECT "identities".* FROM "identities" WHERE "identities"."id" = ? LIMIT 1  [["id", "2"]]